# use with 'brew bundle'

tap 'homebrew/core'
tap 'hlrs-vis/tap'

brew 'cmake'

brew 'boost'
brew 'assimp'
brew 'ispc'
brew 'jpeg-turbo'
brew 'mpich'
brew 'snappy'
brew 'zstd'
brew 'lz4'
brew 'qt5'
brew 'tbb'
brew 'glew'
brew 'open-scene-graph'
brew 'libzip'
brew 'libarchive'
brew 'vtk'
brew 'tinyxml2'
brew 'hdf5', args: ['with-mpi']
brew 'hlrs-vis/tap/covise'
