# use with 'brew bundle'

tap 'homebrew/core'
tap 'hlrs-vis/tap'

brew 'cmake'

brew 'botan'
brew 'coreutils'
brew 'libomp'
brew 'boost'
brew 'assimp'
brew 'ispc'
brew 'embree'
brew 'jpeg-turbo'
brew 'open-mpi'
brew 'zstd'
brew 'lz4'
brew 'qt'
brew 'tbb'
brew 'glew'
brew 'open-scene-graph'
brew 'libzip'
brew 'libarchive'
brew 'vtk'
brew 'tinyxml2'
brew 'python3'

#brew 'hdf5', args: ['with-mpi']
brew 'hdf5'
brew 'netcdf'
brew 'pnetcdf'
brew 'hlrs-vis/tap/covise'
